tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "v2ray/v2ray"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node@12"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Web caching proxy
brew "polipo", restart_service: :changed
# Object-relational database system
brew "postgresql", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python"
# Messaging broker
brew "rabbitmq", link: false
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# HTTP benchmarking tool
brew "wrk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Download YouTube videos from the command-line
brew "youtube-dl"
# A platform for building proxies to bypass network restrictions.
brew "v2ray/v2ray/v2ray-core"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"

cask "font-cascadia"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "fork"
cask "v2rayu"
cask "multipass"
cask "virtualbox"
